
const questions = [
  {
      nQ: 1,
      q: 'الى ماذا يرمز المصطلح ICT ؟',
      a1: 'تكنولوجيا المعلومات والاتصالات',
      a2: 'تكنولوجيا الانترنت والحاسوب',
      a3: 'تكنولوجيا المعلومات والحاسوب',
      a4: 'الانترنت والتحكم بالنقل ',
      wrA: 'تكنولوجيا المعلومات والاتصالات'
  },
  {
      nQ: 2,
      q: 'اي مما يلي لا يعمل على تحسين اداء الحاسوب ؟',
      a1: 'سرعة المعالج',
      a2: 'حجم ذاكرة القراءة فقط',
      a3: 'حجم ذاكرة الوصول العشوائي',
      a4: 'حجم القرص الصلب',
      wrA: 'حجم ذاكرة القراءة فقط'
  },
  
  {
      nQ: 3,
      q: 'اي مما يلي يعد حاسوبا ؟',
      a1: 'رخصة برنامج',
      a2: 'مكبر الصوت',
      a3: 'نظام التشغيل',
      a4: 'الحاسب المحمول',
      wrA: 'الحاسب المحمول'
  },
  {
      nQ: 4,
      q: 'اي أجزاء الحاسوب الاتية مسؤول عن التحكم بتنفيذ التعليمات بشكل كامل ؟',
      a1: 'وحدةالطاقة',
      a2: 'محرك القرص الرقمي',
      a3: 'محرك القرص الصلب',
      a4: 'المعالج',
      wrA: 'المعالج'
  },
  {
      nQ: 5,
      q: 'اي مما يلي يشير الى مصطلح USB ؟',
      a1: 'المصرف المتسلسل الشامل',
      a2: 'الكتلة المتسلسلة الشاملة',
      a3: 'الناقل المتسلسل الشامل',
      a4: 'الفراغ المتسلسل الشامل',
      wrA: 'الناقل المتسلسل الشامل'
  },
  {
      nQ: 6,
      q: 'المنفذ الذي يقوم بنقل الصوت والصورة في كبل واحد ويتم من خلالة وصل جهاز التلفاز ونظم العاب الفيديو بالحاسوب ؟',
      a1: 'المنفذ المتوازي',
      a2: 'المنفذ الناقل التسلسلي الشامل',
      a3: 'منفذ الفيديو ',
      a4: 'المنفذ متعدد الوسائط عالي الوضوح HDMI',
      wrA: 'المنفذ متعدد الوسائط عالي الوضوح HDMI'
  },
  {
      nQ: 7,
      q: 'اي مما يلي يعتبر منفذ ادخال واخراج معا ؟',
      a1: 'الفارة',
      a2: 'الشاشة',
      a3: 'المنفذ متعدد الوسائط عالي الوضوح HDMI',
      a4: 'الماسح الضوئي',
      wrA: 'المنفذ متعدد الوسائط عالي الوضوح HDMI'
  },
  {
      nQ: 8,
      q: 'اي من الانواع البرمجيات الاتية يقوم بادارة مصادر الحاسوب كالذاكرة مثلا ؟',
      a1: 'برامج نظام التشغيل',
      a2: 'برامج قواعد البيانات',
      a3: 'برامج معالجة النصوص',
      a4: 'برامج الجداول الالكترونية',
      wrA: 'برامج نظام التشغيل'
  },
  {
      nQ: 9,
      q: 'اي مما ياتي هو مثال على برنامج نظام التشغيل ؟',
      a1: 'اندرويد',
      a2: 'اكسل',
      a3: 'ادوبي ريدر',
      a4: 'اكسس',
      wrA: 'اندرويد'
  },
  {
      nQ: 10,
      q: 'اي مما يلي يعتبر ضروريا لعمل الحاسوب ؟',
      a1: 'معالج النصوص',
      a2: 'النشر المكتبي',
      a3: 'قواعد البيانات',
      a4: 'نظام التشغيل',
      wrA: 'نظام التشغيل'
  },
  {
      nQ: 11,
      q: 'ماذا ندعو مجموعة التعليمات والتوجيهات التي يحتاجها الحاسوب لاداء مهامه ؟',
      a1: 'البرمجيات',
      a2: 'المعدات',
      a3: 'جدار الحمايه',
      a4: 'المنسقات الضوئية',
      wrA: 'البرمجيات'
  },
  {
      nQ: 12,
      q: 'اي مما ياتي هو مثال على برنامج نظام التشغيل ؟',
      a1: 'معالج النصوص',
      a2: 'النشر المكتبي',
      a3: 'ادارة المشاريع',
      a4: 'لينوكس',
      wrA: 'لينوكس'
  },
  
  {
      nQ: 13,
      q: 'اي من انظمة التشغيل التالية لايستخدم واجهة رسوميه GUI ؟',
      a1: 'windows',
      a2: 'Unix',
      a3: 'Dos',
      a4: 'Linux',
      wrA: 'Dos'
  },
  {
      nQ: 14,
      q: 'اي مما ياتي هو برنامج يمكن تنزيله واستخدامه مع بعض القيود وعادة مايتطلب الشراء والتسجيل لاستخدامه بشكل فوري ؟',
      a1: 'البرنامج التطبيقي',
      a2: 'البرنامج المجاني',
      a3: 'البرنامج مفتوح المصدر',
      a4: 'البرنامج التجريبي',
      wrA: 'البرنامج التجريبي'
  },
  {
      nQ: 15,
      q: 'اي مما يلي هو احد البرامج التطبيقيه ؟',
      a1: 'الطابعة',
      a2: 'القرص الصلب',
      a3: 'ذاكرة الوصول العشوائي ',
      a4: 'متصفح الانترنت',
      wrA: 'متصفح الانترنت'
  },
  {
      nQ: 16,
      q: 'اي من انواع رخص البرمجيات التالية يحتاجها المستخدم  للاستخدام الشخصي لبرنامج معين ؟',
      a1: 'رخصة برنامج  مجاني',
      a2: 'رخصة مستخدم بنطاق عام',
      a3: 'رخصة برنامج فردية',
      a4: 'رخصة برنامج تجريبي',
      wrA: 'رخصة برنامج فردية'
  },
  {
      nQ: 17,
      q: 'الى ماذا يشير المصطلح EULA ؟',
      a1: 'end-user license attached مرفق ترخيص المستخدم النهائي',
      a2: 'end-user license agreemen اتفاقية ترخيص المستخدم النهائي',
      a3: 'end-user license allowance السماح بترخيص المستخدم النهائي ',
      a4: 'end -user license account حساب ترخيص المستخدم النهائي',
      wrA: 'end-user license agreemen اتفاقية ترخيص المستخدم النهائي'
  },
  {
      nQ: 18,
      q: 'اي مما يلي هو طريقة لمشاركة الافكار والنشاطات والاهتمامات عبر الانترنت ؟',
      a1: 'الشبكه الاجتماعيه',
      a2: 'انشاء المستندات',
      a3: 'تخزين السجلات',
      a4: 'طباعة رسالة',
      wrA: 'الشبكه الاجتماعيه'
  },
  {
      nQ: 19,
      q: 'اي من البرامج التالية يتم استخدامه دون دفع أي رسوم ؟',
      a1: 'الرنامج التجريبي',
      a2: 'البرنامج التطبيقي',
      a3: 'البرنامج المجاني',
      a4: 'البرنامج مفتوح المصدر',
      wrA: 'البرنامج المجاني'
  },
  {
      nQ: 20,
      q: 'اي مما ياتي يعد مجلدا فرعيا ؟',
      a1: 'مجلد على محرك الاقراص',
      a2: 'مجلد ضمن ملف',
      a3: 'مجلد ضمن مجلداخر',
      a4: 'مجلد',
      wrA: 'مجلد ضمن مجلداخر'
  },
  {
      nQ: 21,
      q: 'ماذا ندعو النظام المكون من حاسوبين او اكثر والمترابطة معا بواسطة خطوط اتصال لها قدرة على نقل البيانات ؟',
      a1: 'جدار ناري',
      a2: 'الشبكة',
      a3: 'الخادم',
      a4: 'نضام التشفيل',
      wrA: 'الشبكة'
  },
  {
      nQ: 22,
      q: 'اي مما ياتي هو شبكة عالمية من شبكات الحاسوب ؟',
      a1: 'نقل بيانات',
      a2: 'الانترنيت',
      a3: 'الانترانت',
      a4: 'الاكسترانيت',
      wrA: 'الانترنيت'
  },
  {
      nQ: 23,
      q: 'ماذا يطلق على عملية استقبال البيانات مثل الصور والملفات من الحاسوب بعيد عبر الانترنت ؟',
      a1: 'تكبير الحجم ',
      a2: 'التحميل',
      a3: 'الالغاء',
      a4: 'التنزيل',
      wrA: 'التنزيل'
  },
  {
      nQ: 24,
      q: 'اي مما يلي هو من مميزات شبكة الحاسوب ؟',
      a1: 'زيادة سرعة انجاز العمليات',
      a2: 'المشاركة في مستندات الشركة',
      a3: 'التقليل من خمول النظام',
      a4: 'سرعة الدخول الى النظام',
      wrA: 'المشاركة في مستندات الشركة'
  },
  {
      nQ: 25,
      q: 'ماذا نسمي خدمة كتابة الرسائل وارسالها واستقبالها باستخدام نظام الاتصال الالكتروني ؟',
      a1: 'المراسلة الفورية',
      a2: 'موجز الويب',
      a3: 'البريد الالكتروني',
      a4: 'بروتوكول نقل الصوت عبر الانترنيت',
      wrA: 'البريد الالكتروني'
  },
  {
      nQ: 26,
      q: 'اي مما يلي هو من مزايا بووتوكول نقل الصوت عبر الانترنت ؟',
      a1: 'لايحتاج الى معدات',
      a2: 'تناسب الاشخاص ذوي الاحتياجات الخاصة',
      a3: 'سهوله المراسله الفوريه',
      a4: 'انخفاض كلفة الاتصال',
      wrA: 'انخفاض كلفة الاتصال'
  },
  {
      nQ: 27,
      q: 'اي مما ياتي هو افضل وصف للتخزين عبر الانترنت ؟',
      a1: 'التكنولوجيا التي لاتسمح بتخزين بياناتك على قرص صلب داخلي',
      a2: 'التكنولوجيا التي تسمح لك بتخزين بياناتك على الانترنيت',
      a3: 'التكنولوجيا التي لاتسمح بتخزين بياناتك على قرص بلواري',
      a4: 'USB التكنولوجياالتي تسمح لك بتخزين بياناتك على محرك فلاش',
      wrA: 'التكنولوجيا التي تسمح لك بتخزين بياناتك على الانترنيت'
  },
  {
      nQ: 28,
      q: 'اي العبارات صحيحة ؟',
      a1: 'الكيلوبايت اكبر من الميغابايت',
      a2: 'التيرابايت اقل من الميغابايت',
      a3: 'الكيلوبايت اكبر من التيرابايت',
      a4: 'الميغابايت اقل الغيغابايت',
      wrA: 'الميغابايت اقل الغيغابايت'
  },
  {
      nQ: 29,
      q: 'ماذا نطلق على مقدار مايتم ارساله او استقباله عبر الشبكات من بيانات في الثانيه الواحده ؟',
      a1: 'بروتوكول نقل الملفات ',
      a2: 'سرعه المعالج',
      a3: 'معدل نقل البيانات',
      a4: 'مشاركه الملفات',
      wrA: 'معدل نقل البيانات'
  },
  {
      nQ: 30,
      q: 'ماهو السبب الذي يجعل المستخدمين يقومون بتسجيل الدخول باستخدام اسم المستخدم وكلمة المرور ؟',
      a1: 'لمعرفة الاشخاص المتواجدين في المبنى',
      a2: 'لالقاء التحية الشخصية لكل مستخدم',
      a3: 'لحمايه الحاسب من الاستخدام غير المصرح به',
      a4: 'للتاكد من حفظ وقت الدخول للمستخدمين',
      wrA: 'لحمايه الحاسب من الاستخدام غير المصرح به'
  },
  {
      nQ: 31,
      q: 'يقاس معدل نقل البيانات بواحدة ؟',
      a1: 'تيرابايت',
      a2: 'دورة في الثانية',
      a3: 'غيغاهرتز',
      a4: 'بت في الثانيه',
      wrA: 'بت في الثانيه'
  },
  {
      nQ: 32,
      q: 'اي مما يلي ليس خيارا من خيارات الاتصال بالانترنت ؟',
      a1: 'السلك (الكابل)',
      a2: 'القمر الصناعي',
      a3: 'المعالج',
      a4: 'الواي ماكس',
      wrA: 'المعالج'
  },
  
  {
      nQ: 33,
      q: 'اي الاتصالات التاليه بالانترنت يعد الابطا نسبيا؟',
      a1: 'الاتصال العريض',
      a2: 'WI-FI',
      a3: 'الاتصال الهاتفي',
      a4: 'WI-MAX',
      wrA: 'الاتصال الهاتفي'
  },
  {
      nQ: 34,
      q: 'ماهي طريقة تعريف المستخدمين عند تسجيل الدخول الى الحاسب لحمايه المعلومات الخاصة والحفاظ على امن البيانات ؟',
      a1: 'تنصيب جدار ناري',
      a2: 'استخدام التوقيع الرقمي',
      a3: 'تشفير البيانات بكلمه سر',
      a4: 'اسم مستخدم وكلمة مرور',
      wrA: 'اسم مستخدم وكلمة مرور'
  },
  {
      nQ: 35,
      q: 'اي مما ياتي افضل  وصف في سبب انشاء النسخ الاحتياطي للبيانات ؟',
      a1: 'لتوفير مساحه اكبر لتخزين الملفات على القرص الصلب',
      a2: 'لتمكين الوصول الى البيانات من اي جزء في العالم ',
      a3: 'لتخزين الملفات باكثر الطرق فاعلية من حيث التكلفة',
      a4: 'لتجنب فقدان الملفات في حال تلف النسخه الاصلية',
      wrA: 'لتجنب فقدان الملفات في حال تلف النسخه الاصلية'
  },
  {
      nQ: 36,
      q: 'اي مما يلي يعتبر صحيحا فيما يتعلق بكلمة السر ؟',
      a1: 'يجب تغييرها بانتظام',
      a2: 'لايجب ان تحتوي على رموز وحروف خاصه',
      a3: 'يجب ان تكون معروفه من قبل المسؤل عن النظام',
      a4: 'يجب تغييرها فقط اذا تم المساس بها اوتم تخمينها',
      wrA: 'يجب تغييرها بانتظام'
  },
  {
      nQ: 37,
      q: 'لماذا يستخدم جدار الحمايه ؟',
      a1: 'تحديد صلاحيات الدخول',
      a2: 'الحفاظ على الشبكة امنة',
      a3: 'وقف انتشار الفيروسات',
      a4: 'جعل الاشخاص يعملون بجهد اكبر',
      wrA: 'الحفاظ على الشبكة امنة'
  },
  {
      nQ: 38,
      q: 'مالذي يقوم بتصفية وفلترة كل محاولات الدخول الى الشبكه ؟',
      a1: 'الرقابه الابوية',
      a2: 'المقاييس الحيوية',
      a3: 'الجدار الناري',
      a4: 'مضاد فيروسات',
      wrA: 'الجدار الناري'
  },
  {
      nQ: 39,
      q: 'اي مما يلي يراقب الحركة القادمة على الشبكة لحمايتها من الهجوم الخارجي ؟',
      a1: 'درع البيانات',
      a2: 'الحارس الناري',
      a3: 'درع الشبكة',
      a4: 'الجدار الناري',
      wrA: 'الجدار الناري'
  },
  {
      nQ: 40,
      q: 'ما الذي ينبغي القيام به لضمان توفر البيانات وعدم ضياعها أو تلفها ؟ ',
      a1: 'تنصيب الجدار الناري',
      a2: 'تنظيم الملفات في المجلدات',
      a3: 'تشفير البيانات ',
      a4: 'القيام بالنسخ الاحتياطي',
      wrA: 'القيام بالنسخ الاحتياطي'
  },
  {
      nQ: 41,
      q: 'أي مما يلي يوضح أهمية استخدام الجدران النارية ؟ ',
      a1: 'لمنع تدميرالحاسوب في حالة حدوث حريق',
      a2: 'لكشف وابطال الفيروسات الموجودة على الحاسب',
      a3: 'لتمكين تحميل البيانات بسهولة من المواقع على شبكة الانترنت',
      a4: 'لمنع الدخول غيرالمصرح به من قبل الاتصالات الواردة على الشبكة',
      wrA: 'لمنع الدخول غيرالمصرح به من قبل الاتصالات الواردة على الشبكة'
  },
  {
      nQ: 42,
      q: 'ما هو السبب الهام الذي يتوجب من اجله إنشاء نسخ احتياطية من البيانات بشكل دوري ؟',
      a1: 'امتثالا لقانون البيانات',
      a2: 'لمنع فقدان البيانات',
      a3: 'لحماية الحاسوب',
      a4: 'لزيادة مساحة القرص الصلب الفارغة',
      wrA: 'لمنع فقدان البيانات'
  },
  {
      nQ: 43,
      q: 'ما هو الخيار المناسب للوقاية من الفيروسات ؟ ',
      a1: 'تعليم الرسالة الالكترونية كغير مقروءة',
      a2: 'تعليم الرسالة الالكترونية كمقروءة',
      a3: 'تأجيل قراءة الرسالة الالكترونية لأسبوع',
      a4: 'عدم فتح رسالة الكترونية مجهولة المصدر',
      wrA: 'عدم فتح رسالة الكترونية مجهولة المصدر'
  },
  {
      nQ: 44,
      q: 'أي من الاماكن التالية هو الافضل لحفظ النسخ الاحتياطية من البيانات بشكل آمن ؟',
      a1: 'في موقع محصن ضد الحريق',
      a2: 'بجانب الحاسوب',
      a3: 'في موقع بعيد عن الحاسوب',
      a4: 'في القرص المحلي C',
      wrA: 'في موقع بعيد عن الحاسوب'
  },
  {
      nQ: 45,
      q: 'أي مما يلي يوضح الحاجة الضرورية لتحديث برامج مكافحة الفيروسات بانتظام ؟ ',
      a1: 'لحماية الحاسوب من الرسائل غير المرغوب فيها',
      a2: 'لمنع انتشار البرامج الضارة على الانترنت',
      a3: 'للتأكد من ان البرنامج يتعرف على الفيروسات القديمة',
      a4: 'لحماية الحاسوب من جميع الفيروسات المعروفة',
      wrA: 'لحماية الحاسوب من جميع الفيروسات المعروفة'
  },
  {
      nQ: 46,
      q: 'اي الطرق التالية يعد أفضل لمنع فقدان البيانات في حال حدوث انقطاع التيار الكهربائي ؟ ',
      a1: 'استخدام مقابس فلترة للكهرباء',
      a2: 'استخدام برنامج مكافحة الفيروسات',
      a3: 'التأكد من استخدام اسم مستخدم وكلمة مرور',
      a4: 'عمل نسخ احتياطية بشكل دوري للبيانات',
      wrA: 'عمل نسخ احتياطية بشكل دوري للبيانات'
  },
  {
      nQ: 47,
      q: 'ماذا ندعو البرامج الخبيثة التي لاتحتاج إلى الصاق نفسها ببرنامج آخر ولا الى تدخل من قبل المستخدم لكي تنتشر ؟ ',
      a1: 'الفيروسات',
      a2: 'الديدان',
      a3: 'أحصنة طروادة',
      a4: 'برامج التجسس',
      wrA: 'الديدان'
  },
  {
      nQ: 48,
      q: 'ماذا ندعو البرامج التي تبدو مفيدة ولكن عندما يتم تشغيلها يتم تثبيت أوامر وبرمجيات خبيثة على الحاسوب دون علم المستخدم ؟',
      a1: 'الفيروسات',
      a2: 'الديدان',
      a3: 'أحصنة طروادة',
      a4: 'برامج التجسس',
      wrA: 'أحصنة طروادة'
  },
  {
      nQ: 49,
      q: 'أي مما يأتي أحد أنواع البرامج الضارة التي تنسخ نفسها وتنتشر من حاسوب لآخر من خلال إصابة الملفات الاخرى ؟',
      a1: 'الجدار الناري',
      a2: 'البرامج التطبيقية',
      a3: 'نظام التشغيل',
      a4: 'الفيروسات',
      wrA: 'الفيروسات'
  },
  {
      nQ: 50,
      q: 'أي مما يلي يعمل على منع إصابة حاسوبك بالبرامج الضارة ؟',
      a1: 'تحديث برامج مكافحة الفيروسات',
      a2: 'إنشاء نسخ احتياطية للفيروسات',
      a3: 'تثبيت البرامج التي تمنع القرصنة',
      a4: 'تثبيت كلمة مرور أمان على الجهاز',
      wrA: 'تحديث برامج مكافحة الفيروسات'
  },
  {
      nQ: 51,
      q: 'أي مما يلي يحمي استخدامه جهاز الحاسوب من خطر البرامج الضارة ؟ ',
      a1: 'برمجيات تشخيص وإصلاح الحاسوب',
      a2: 'برمجيات مكافحة البريد المزعج',
      a3: 'برمجيات مكافحة التجسس',
      a4: 'برمجيات تتبع مواقع الويب',
      wrA: 'برمجيات مكافحة التجسس'
  },
  {
      nQ: 52,
      q: 'أي من الخيارات التالية يمكن ان يؤدي الى انتشار البرامج الضارة ؟ ',
      a1: 'فتح المرفقات التي تم فتحها من الفيروسات',
      a2: 'تحديث البرامج المضادة للفيروسات بانتظام',
      a3: 'استخدام البرامج التي تم فحصها من الفيروسات فقط',
      a4: 'استخدام ذاكرة الفلاش لتبادل البيانات من مصادر غير معروفة',
      wrA: 'استخدام ذاكرة الفلاش لتبادل البيانات من مصادر غير معروفة'
  },
  {
      nQ: 53,
      q: 'أي مما يلي يسمح للفيروس بالدخول الى الحاسوب او الاجهزة ؟ ',
      a1: 'استخدام البرمجيات التجارية الت تم فحصها من الفيروسات',
      a2: 'فتح الملفات المرسلة من مجهولين',
      a3: 'استخدام شاشة التوقف',
      a4: 'استخدام حاسوب آمن لإرسال البريد الالكتروني',
      wrA: 'فتح الملفات المرسلة من مجهولين'
  },
  {
      nQ: 54,
      q: 'أي الانشطة التالية يؤدي الى اصابة الحاسوب أو الاجهزة بالبرامج الماكرة ؟ ',
      a1: 'تنزيل الملفات من مصدر مجهول',
      a2: 'تغيير شاشة العرض',
      a3: 'فرز الملفات والمجلدات',
      a4: 'نسخ البيانات نسخا احتياطيا بعيدا عن موقعها',
      wrA: 'تنزيل الملفات من مصدر مجهول'
  },
  {
      nQ: 55,
      q: 'أي مما يلي يمكن ان يكون وصفا لفيروس الحاسب ؟ ',
      a1: 'برنامج يمكنه تدمير الحاسوب',
      a2: 'خطأ في المعدات',
      a3: 'برنامج يتم تنزيله من الانترنت',
      a4: 'منطقة تالفة في القرص الصلب',
      wrA: 'برنامج يمكنه تدمير الحاسوب'
  },
  {
      nQ: 56,
      q: 'ماذا ندعو البرامج الت تتم كتابتها بواسطة مبرمجين محترفين بغرض الحاق الضرر بحاسوب آخر ؟ ',
      a1: 'البرامج التنفيذية',
      a2: 'وحدات الماكرو',
      a3: 'الفيروسات',
      a4: 'التشفير',
      wrA: 'الفيروسات'
  },
  {
      nQ: 57,
      q: 'أي مما يلي يعمل على توفير الطاقة الكهربائية عند استعمال الحاسوب ؟',
      a1: 'زيادة سعة الذاكرة الافتراضية',
      a2: 'زيادة سعة القرص الصلب',
      a3: 'تعيين خلفية مناسبة لسطح المكتب',
      a4: 'إنقاص ضور الخلفية بعد فترة من التوقف عن العمل',
      wrA: 'إنقاص ضور الخلفية بعد فترة من التوقف عن العمل'
  },
  {
      nQ: 58,
      q: 'أي ممل يلي يعد ممارسة جيدة في توفير الطاقة ؟',
      a1: 'تحديث شاشة التوقف بشكل دوري',
      a2: 'تغيير صورة خلفية الشاشة',
      a3: 'تحديث شاشة العرض بشكل دوري',
      a4: 'ضبط إعدادات الشاشة للإطفاء بشكل تلقائي عند التوقف عن العمل على الحاسوب',
      wrA: 'ضبط إعدادات الشاشة للإطفاء بشكل تلقائي عند التوقف عن العمل على الحاسوب'
  },
  {
      nQ: 59,
      q: 'يمكن المساعدة في حماية البيئة عن طريق ؟',
      a1: 'استخدام حافظ الشاشة',
      a2: 'التقليل من الطباعة على الورق',
      a3: 'استخدام سماعات الرأس',
      a4: 'استخدام شاشات صغيرة',
      wrA: 'التقليل من الطباعة على الورق'
  },
  {
      nQ: 60,
      q: 'أي مما يلي يعد ممارسة جيدة لأسباب بيئية ؟ ',
      a1: 'تثبيت برامج مكافحة الفيروسات',
      a2: 'إعادة تدوير الورق المستخدم',
      a3: 'التخلص من عبوات الحبر',
      a4: 'تفقد البريد الوارد',
      wrA: 'إعادة تدوير الورق المستخدم'
  },
  {
      nQ: 61,
      q: 'ما الذي ينبغي فعله بعبوات حبر الطابعة الفارغة ؟',
      a1: 'ارسالها للشركة المصنعة',
      a2: 'التخلص منها عن طريق تكسيرها',
      a3: 'إلقاؤها في سلة المهملات',
      a4: 'إعطاؤها للأطفال للعب بها',
      wrA: 'ارسالها للشركة المصنعة'
  },
  {
      nQ: 62,
      q: 'أي مما يلي ليس ممارسة صحيحة فيما يتعلق بكلمات المرور ؟',
      a1: 'عدم مشاركة كلمات المرور مع اي شخص نهائيا',
      a2: 'إنشاء كلمة مرور تتألف من 8 حروف',
      a3: 'أنشاء كلمات مرور من خليط من الحروف والأرقام',
      a4: 'عدم تغيير كلمات المرور نهائيا',
      wrA: 'عدم تغيير كلمات المرور نهائيا'
  },
  {
      nQ: 63,
      q: 'أي مما يلي هي سياسة كلمة مرور جيدة لمنظمة ؟',
      a1: 'تغيير كلمات المرور بشكل دوري',
      a2: 'استخدام كلمات المرور التي تتألف من 4 حروف',
      a3: 'مشاركة كلمات المرور',
      a4: 'استخدام الاسم الشخصي ككلمة مرور',
      wrA: 'تغيير كلمات المرور بشكل دوري'
  },
  {
      nQ: 64,
      q: 'أي كلمات المرور الآتية هي الانسب ؟',
      a1: '123456',
      a2: 'PASSWORD',
      a3: 'password',
      a4: 'p$$WoRd788',
      wrA: 'p$$WoRd788'
  },
  {
      nQ: 65,
      q: 'أي مما يلي لا يعتبر من الامور الهامة عند اشتراك في خدمة الانترنت ؟',
      a1: 'سرعة التحميل',
      a2: 'سرعة التنزيل',
      a3: 'سعة التنزيل',
      a4: 'سرعة المعالج',
      wrA: 'سرعة المعالج'
  },
  {
      nQ: 66,
      q: 'أي مما يلي يعمل على تحسين أداء الحاسوب ؟',
      a1: 'تكبير شاشة العرض',
      a2: 'تصغير حجم ذاكرة الوصول العشوائي RAM',
      a3: 'تصغير حجم شاشة العرض',
      a4: 'تكبير حجم ذاكرة الوصول العشوائي RAM',
      wrA: 'تكبير حجم ذاكرة الوصول العشوائي RAM'
  },
  {
      nQ: 67,
      q: 'أي مما يلي يمثل الهدف الرئيسي لذاكرة الوصول العشوائي RAM ؟',
      a1: 'للسماح للمستخدمين بإدخال المعلومات للحاسوب',
      a2: 'لتوفير وسيط تخزين قابل للإزالة للبيانات الدائمة',
      a3: 'للتعامل مع البيانات وتنفيذ العمليات',
      a4: 'لتوفير مساحة تخزين مؤقتة للبياتات والتعليميات',
      wrA: 'لتوفير مساحة تخزين مؤقتة للبياتات والتعليميات'
  },
  {
      nQ: 68,
      q: 'أي مما يلي يقلل من إجهاد العين ؟',
      a1: 'الجلوس قريبا من الشاشة',
      a2: 'تعيين شاشة توقف',
      a3: 'أخذ فترات استراحة بشكل منتظم',
      a4: 'تدوير الورق التالف',
      wrA: 'أخذ فترات استراحة بشكل منتظم'
  },
  {
      nQ: 69,
      q: 'أي مما يلي هو نوع من أنواع منافذ الادخال والاخراج ',
      a1: 'الناقل المتسلسل الشامل USB',
      a2: 'الطابعة',
      a3: 'الفأرة',
      a4: 'ذاكرة الوصول العشوائي RAM',
      wrA: 'الناقل المتسلسل الشامل USB'
  },
  {
      nQ: 70,
      q: 'أي الأنواع البرامج التالية يعمل على إدارة ذاكرةالحاسوب ؟',
      a1: 'برنامج متصفح الانترنت',
      a2: 'برنامج نظام التشغيل',
      a3: 'البرامج التطبيقية',
      a4: 'برامج مكافحة الفيروسات',
      wrA: 'برنامج نظام التشغيل'
  },
  {
      nQ: 71,
      q: 'أي مما يلي هو برنامج يمكن نتزيله واستخدامه مع بعض القيود وعادة ما يتطلب الشراء والتسجيل لاستخدمه بشكل قانوني ؟',
      a1: 'البرامج المجانية',
      a2: 'البرامج التجريبية',
      a3: 'البرامج الثابتة',
      a4: 'البرامج مفتوحة المصدر',
      wrA: 'البرامج التجريبية'
  },
  {
      nQ: 72,
      q: 'أي مما يلي يمثل الطريقة المستخدمة في تنظيم الملفات ؟',
      a1: 'هرمي',
      a2: 'شريطي',
      a3: 'خطي',
      a4: 'دائري',
      wrA: 'هرمي'
  },
  {
      nQ: 73,
      q: 'أي مما يلي ليس جزءا من نظام الملفات الهرمي ؟',
      a1: 'مجلد',
      a2: 'شاشة التوقف',
      a3: 'محرك اقراص',
      a4: 'ملف',
      wrA: 'شاشة التوقف'
  },
  {
      nQ: 74,
      q: 'أي المجلدات التالية هي الاكبر حجما ؟',
      a1: 'مجلد حجمه 1 تيرا بايت',
      a2: 'مجلد حجمه 100 كيلو بايت',
      a3: 'مجلد حجمه 2 غيغا بايت',
      a4: 'مجلد حجمه 50 ميغا بايت',
      wrA: 'مجلد حجمه 1 تيرا بايت'
  },
  {
      nQ: 75,
      q: 'أي مما يلي يعمل على تصغير حجم مجلد وأي ملفات يحتويها هذا المجلد بحيث يأخذ مساحة أقل على القرص الصلب ؟',
      a1: 'برامج استخراج الملفات',
      a2: 'برامج الجداول الالكترونية',
      a3: 'برامج الضغط',
      a4: 'برامج مكافحة الفيروسات',
      wrA: 'برامج الضغط'
  },
  {
      nQ: 76,
      q: 'أي من أنواع الملفات التالية يمثل تنسيق ملفات الفيديو ؟',
      a1: '.MP3',
      a2: '.WAV',
      a3: '.AVI',
      a4: '.jpg',
      wrA: '.AVI'
  },
  {
      nQ: 77,
      q: 'أي مما يلي يعمل على تخزين فيديو عالي الجودة ؟',
      a1: 'القرص الرقمي (DVD)',
      a2: 'القرص المدمج / المضغوط (CD-ROM)',
      a3: 'قرص بلوراي blue-ray',
      a4: 'بطاقة الذاكرة memory card',
      wrA: 'قرص بلوراي blue-ray'
  },
  {
      nQ: 78,
      q: 'أي مما يلي يستخدم للمشاركة وللوصول الى البيانات والاجهزة بشكل آمن ؟',
      a1: 'البريد الالكتروني',
      a2: 'بروتوكول نقل الصوت عبر الانترنت',
      a3: 'الشبكة',
      a4: 'الناقل المتسلسل الشامل',
      wrA: 'الشبكة'
  },
  {
      nQ: 79,
      q: 'أي مما يلي هو أفضل وصف لمزود خدمة الانترنت ؟',
      a1: 'برامج تسمح للمستخدمين بالاتصال بالبحث عن المعلومات عبر الانترنت',
      a2: 'برامج تسمح للمستخدمين الاتصال بالانترنت',
      a3: 'مؤسسة تقوم ببيع برامج مكافحة الفيروسات وبرامج الأمان',
      a4: 'مؤسسة تعمل على إيصال الناس بالانترنت',
      wrA: 'مؤسسة تعمل على إيصال الناس بالانترنت'
  },
  {
      nQ: 80,
      q: 'أي مما يلي يعتبر أفضل وصف للشبكة الافتراضية الخاصة ؟',
      a1: 'شبكة خاصة آمنة',
      a2: 'نظام تشغيل الشبكة',
      a3: 'شبكة عالمية من شبكات حواسيب مرتبطة',
      a4: 'شبكة عامة متاحة للجميع',
      wrA: 'شبكة خاصة آمنة'
  },
  {
      nQ: 81,
      q: 'أي من الخيارات التالية متوفر في الاعمال المصرفية عبر الانترنت ؟',
      a1: 'التحدث مع مدير البنك',
      a2: 'تحويل الأموال بين الحسابات',
      a3: 'إيداع الاموال في الحساب',
      a4: 'سحب مال نقدي من الحساب',
      wrA: 'تحويل الأموال بين الحسابات'
  },
  {
      nQ: 82,
      q: 'أي مما يلي هو أفضل وصف للهدف الرئيسي من الشبكات ؟',
      a1: 'لإرسال رسائل البريد الالكتروني واستقبالها بشكل آمن',
      a2: 'لمشاركة خطوط الهاتف والوصول اليها بشكل آمن',
      a3: 'لمشاركة البيانات والوصول اليها بشكل آمن',
      a4: 'لإرسال الرسائل الفورية واستقبالها بشكل آمن',
      wrA: 'لمشاركة البيانات والوصول اليها بشكل آمن'
  },
  {
      nQ: 83,
      q: 'أي مما يلي يبين استخدام بروتوكول نقل الصوت عبر الانترنت VOIP ؟',
      a1: 'لتحميل الملفات الى الانترنت',
      a2: 'لإجراء المكالمات الهاتفية عبر الانترنت',
      a3: 'لتنزيل الصور عبر الانترنت',
      a4: 'لإرسال رسائل الكترونية عبر الانترنت',
      wrA: 'لإجراء المكالمات الهاتفية عبر الانترنت'
  },
  {
      nQ: 84,
      q: 'أي الطرق الاتية تمكنك من الاتصال بالشبكة اللاسلكية ؟',
      a1: 'من شريط المهام , منطقة الإعلام , ننقر على رمز الشبكة , ثم ننقر على الشبكة اللاسلكية المطلوبة',
      a2: 'من مجلد المستخدم الشخصي , ننقر على الشبكة , ثم ننقر على الشبكة اللاسلكية المطلوبة',
      a3: 'من قائمة ابدأ , ننقر على رمز الشبكة , ثم ننقر على الشبكة اللاسلكية المطلوبة',
      a4: 'من مجلد المستخدم الشخصي , ننقر على رمز الشبكة , ثم ننقر على الشبكة اللاسلكية المطلوبة',
      wrA: 'من شريط المهام , منطقة الإعلام , ننقر على رمز الشبكة , ثم ننقر على الشبكة اللاسلكية المطلوبة'
  },
  {
      nQ: 85,
      q: 'أي مما يلي هو برنامج تطبيقي يسمح بإدخال الحروف الى الحاسوب',
      a1: 'مكبر الشاشة',
      a2: 'شاشات التوقف',
      a3: 'لوحة المفاتيح على الشاشة',
      a4: 'قارئ الشاشة',
      wrA: 'لوحة المفاتيح على الشاشة'
  },
  {
      nQ: 86,
      q: 'أي مما يلي اختصار للوصول الى المزيد من المعلومات عن تغير خلفية سطح المكتب ؟',
      a1: 'F1',
      a2: 'CTRL+C',
      a3: 'CTRL+V',
      a4: 'ALT+F4',
      wrA: 'F1'
  },
  {
      nQ: 87,
      q: 'ماذا نطلق على وسيط التخزين أو وحدة التخزين الذي يمكن وضعه في شكلة مفاتيح ؟',
      a1: 'محرك اقراص فلاش',
      a2: 'القرص المضغوط',
      a3: 'القرص الرقمي',
      a4: 'القرص المرن',
      wrA: 'محرك اقراص فلاش'
  },
  {
      nQ: 88,
      q: 'ماذا نطلق على الشبكة التي يمكن الوصول اليها من اي شخص قريب منها ؟',
      a1: 'شبكة بعيدة',
      a2: 'شبكة آمنة',
      a3: 'شبكة مغلقة',
      a4: 'شبكة مفتوحة',
      wrA: 'شبكة مفتوحة'
  },
  {
      nQ: 89,
      q: 'ما هي العملية التي يتم من خلالها استقبال ملفات وصور وموسيقا من حاسوب بعيد ؟',
      a1: 'تنزيل ملفات',
      a2: 'تحميل ملفات',
      a3: 'استقبال ملفات',
      a4: 'ارسال ملفات',
      wrA: 'تنزيل ملفات'
  },
  {
      nQ: 90,
      q: 'أي مما يلي يعد طريقة مناسبة لإيقاف تشغيل تطبيق لايستجيب ؟',
      a1: 'الضغط على لوحة المفاتيح ALT+CTRL+DELETE نختار إدارة المهام , ثم نختار إنهاء المهمة',
      a2: 'إغلاق كافة المستندات والضغط على زر الطاقة الكهربائية حتى يتم إيقاف التشغيل',
      a3: 'النقر على زر ابدأ , ثم النقر على زر إيقاف تشغيل الحاسوب',
      a4: 'سحب كيبل الطاقة الكهربائية من خلف الحاسوب',
      wrA: 'الضغط على لوحة المفاتيح ALT+CTRL+DELETE نختار إدارة المهام , ثم نختار إنهاء المهمة'
  }
  
]